Revit 2027 API
Transform2D.Origin Property
 The image of (0, 0) under OfPoint(UV). This defines the translational part of the transform.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Origin { get; set; }
Public Property Origin As UV
	Get
	Set
public:
property UV^ Origin {
	UV^ get ();
	void set (UV^ value);
}
member Origin : UV with get, set
Property Value
UV
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace